{
  "backend/main.mo": "Main canister managing products, tiers, cart, transactions, and store settings with add/update, delete, query, and cart operations.",
  "backend/migration.mo": "Migration module converting old products to new schema by adding empty tiers and returning updated actor state.",
  "feature_evidence.json": "Feature evidence listing frontend files and components involved in tier pricing and POS cart updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing major components, pages, utilities, and styling.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color palette, dark mode variables, and base layout styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Router setup defining all app routes and wrapping pages in the AppShell layout.",
  "frontend/src/components/AppShell.tsx": "Application layout providing sidebar navigation, branding, footer, and main content area.",
  "frontend/src/components/products/ProductFormDialog.tsx": "Product dialog allowing create/edit with photo upload and dynamic tier pricing fields, including validation and state handling.",
  "frontend/src/components/receipt/ReceiptLayout.tsx": "Renders a printable receipt showing store info, transaction details, item list, totals, and optional cash payment details.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login, logout, and status updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for products, cart, transactions, and store settings using the backend actor, with mutations that trigger cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind-based CSS variables, light/dark themes, and custom print styles for rendering receipts cleanly.",
  "frontend/src/lib/pricing.ts": "Provides utilities for validating, normalizing, and calculating tiered pricing, plus a Rupiah formatting helper.",
  "frontend/src/lib/utils.ts": "Exports a class name merging helper using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutSettingsPage.tsx": "Settings page allowing editing of store name and optional receipt footer, with save handling and validation.",
  "frontend/src/pages/POSPage.tsx": "Point‑of‑sale interface handling product search, barcode input, local cart management, and checkout interactions.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page supporting search, creation, editing, deletion, and stock status display.",
  "frontend/src/pages/ReceiptPage.tsx": "Displays a printable receipt for a selected transaction using settings and product data.",
  "frontend/src/pages/ReportsPage.tsx": "Sales reports page showing totals and grouped transaction metrics across daily, weekly, or monthly periods.",
  "frontend/src/pages/TransactionsPage.tsx": "Transaction history page with date filtering and navigation to individual receipts.",
  "frontend/src/utils/reportGrouping.ts": "Groups transactions by day, week, or month using date-fns and returns sorted period summaries with totals and counts.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Project metadata describing tier/package pricing features, architectural notes, and pending feature requests using option‑B pricing rules."
}